/****************************************Copyright (c)****************************************************
**
**                                 http://www.powermcu.com
**
**--------------File Info---------------------------------------------------------------------------------
** File name:               app_cfg.h
** Descriptions:            ucosii configuration
**
**--------------------------------------------------------------------------------------------------------
** Created by:              AVRman
** Created date:            2010-11-9
** Version:                 v1.0
** Descriptions:            The original version
**
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Version:
** Descriptions:
**
*********************************************************************************************************/

#ifndef  __APP_CFG_H__
#define  __APP_CFG_H__
#include  <os_cpu.h>
/*
*********************************************************************************************************
*                                       MODULE ENABLE / DISABLE
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                              TASKS NAMES
*********************************************************************************************************
*/

__align(8);

//任务函数
extern   void  start_task(void *pdata);






/*
*********************************************************************************************************
*                                           设置任务优先级
*********************************************************************************************************
*/
#define START_TASK_PRIO			  10   ///开始任务的优先级为最低
#define BSP_INIT_TASK_PRIO		11   ///初始化任务的优先级为最低
#define Wheels_TASK_PRIO			12   ///底盘驱动的优先级为最低
#define PASS_TASK_PRIO			  16   ///传球的优先级为最低
#define MOVE_TASK_PRIO			  15   ///运动规划的优先级为最低
#define FSM_TASK_PRIO			    14   ///状态机的优先级最高
#define DEBUG_TASK_PRIO			  13   ///调试的优先级为最低
#define SENSOR_TASK_PRIO		 	17   ///调试的优先级为最低
#define MOTOR_TASK_PRIO			  18   ///M3508电机的优先级为最低



/*
*********************************************************************************************************
*                                          设置任务堆栈大小
*                             Size of the task stacks (# of OS_STK entries)
*********************************************************************************************************
*/
#define START_STK_SIZE			256       //设置任务堆栈大小
#define BSP_INIT_STK_SIZE	  256      
#define Wheels_STK_SIZE			1024u
#define PASS_STK_SIZE			  1024u
#define MOVE_STK_SIZE			  1024u
#define FSM_STK_SIZE			  1024u
#define DEBUG_STK_SIZE			1024u
#define SENSOR_STK_SIZE			1024u
#define MOTOR_STK_SIZE			1024u

/*
*********************************************************************************************************
*                                            任务任务堆栈
*
*********************************************************************************************************
*/
__align(8) static  OS_STK   START_TASK_STK[START_STK_SIZE];
__align(8) static  OS_STK   BSP_INIT_TASK_STK[BSP_INIT_STK_SIZE];
__align(8) static  OS_STK   Wheels_TASK_STK[Wheels_STK_SIZE];
__align(8) static  OS_STK   PASS_TASK_STK[PASS_STK_SIZE];
__align(8) static  OS_STK   MOVE_TASK_STK[MOVE_STK_SIZE];
__align(8) static  OS_STK   FSM_TASK_STK[FSM_STK_SIZE];
__align(8) static  OS_STK   DEBUG_TASK_STK[DEBUG_STK_SIZE];
__align(8) static  OS_STK   SENSOR_TASK_STK[SENSOR_STK_SIZE];
__align(8) static  OS_STK   MOTOR_TASK_STK[MOTOR_STK_SIZE];
/*
*********************************************************************************************************
*                                                  LIB
*********************************************************************************************************
*/



#endif

/*********************************************************************************************************
      END FILE
*********************************************************************************************************/

